In [1]:
import numpy as np
import pandas as pd

In [2]:
label = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {1:10,2:20,3:30}

In [3]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(my_list,label)

a    10
b    20
c    30
dtype: int64

# Creating a DataFrame

In [5]:
# df = pd.read_csv('tips.csv')
# df.head()

In [6]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [7]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [8]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
columns =["Name","Age","City","Salary"]
df2 = pd.DataFrame(data_list,columns = columns)

In [9]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [10]:
df2[["City",'Name']]

       City   Name
0  New York   John
1     Paris   Anna
2    Berlin  Peter
3    London  Linda

# Creating a new column

In [11]:

df2['Designation'] =["doc" , "eng","doc" , "eng"]
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000         doc
1   Anna   34     Paris   70000         eng
2  Peter   29    Berlin   62000         doc
3  Linda   42    London   85000         eng

# Removing a column

In [12]:
df2.drop("Designation", axis=1,inplace=True)

In [13]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [14]:
df2.drop(["City" , "Salary"], axis=1)

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [15]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [16]:
# row  for axis=0 and column for axis=1

In [17]:
df2.drop(0, axis=0)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [18]:
df2.loc[[1,2]]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000

In [19]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [20]:
df2.iloc[1]

Name       Anna
Age          34
City      Paris
Salary    70000
Name: 1, dtype: object

In [21]:
df2.loc[[0,1]] [["City", "Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [22]:
df.loc[[2,3]] [["Name","Age"]]

    Name  Age
2  Peter   29
3  Linda   42

# Conditional Selection

In [23]:
df2[df2["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [24]:
df2[(df2["Age"]>30) & (df["City"] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000

# Missing Data

In [25]:
# finding missing data

In [26]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)

In [27]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [28]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [29]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [30]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

# Removing missing data

In [31]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [32]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [33]:
df.dropna(thresh=3)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

# Filling the missing data

In [34]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [35]:
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [36]:
values = {"A": "a", "B": 'b', "C":'c', "D":'d'}
df.fillna(value=values)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0    d
2    a  3  3.0    d
3  4.0  4    c    d
4  5.0  5    c  5.0

In [37]:
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

# merging joining and concantention

In [38]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [39]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [40]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [41]:
pd.merge(employees,salaries,on='employee_id',how='inner')

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [42]:
pd.merge(employees,salaries,on='employee_id',how='outer')

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [43]:
pd.merge(employees,salaries,on='employee_id',how='left')

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [44]:
pd.merge(employees,salaries,on='employee_id',how='right')

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

# Concatination of 2 dataframes

In [45]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [46]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [47]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [48]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [49]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [50]:
# Joining to data frame

In [51]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [52]:
df1

      name
1    Alice
2      Bob
3  Charlie

In [53]:
df2

   score
2     85
3     90
4     75

In [54]:
df1.join(df2,how='outer')

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

# GroupBy and Aggregation

In [55]:
import numpy as np 
import pandas as pd

In [56]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)

In [57]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [58]:
#group by category and calculate the sum of sales

In [59]:
# cat= df.groupby('Category')
# cat  ##object bna gya
# for i, v in cat:
#     print(i)
#     print(v)

cat= df.groupby('Category')['Sales'].sum()
cat

Category
A    570
B    930
Name: Sales, dtype: int64

In [60]:
cat= df.groupby('Store')['Sales'].sum()
cat

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [61]:
# group by multiple column

In [62]:
cat = df.groupby(['Category','Store'])[['Sales','Quantity']].sum()
cat
# single for[] more thn [[]]

                Sales  Quantity
Category Store
A        S1       220        18
         S2       350        27
B        S1       500        40
         S2       430        38

# Aggregation

In [63]:
df['Sales'].mean()

np.float64(187.5)

In [64]:
df['Sales'].agg(['mean','median'])

mean      187.5
median    190.0
Name: Sales, dtype: float64

# Pivot Table

In [65]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    754     73   John  January      Q1
1  2023-01-02       B   West    363     51   Mary  January      Q1
2  2023-01-03       C  North    949     19    Bob  January      Q1
3  2023-01-04       D  South    158     31  Alice  January      Q1
4  2023-01-05       A   East    177     64   John  January      Q1
5  2023-01-06       B   West    465     36   Mary  January      Q1
6  2023-01-07       C  North    969     67    Bob  January      Q1
7  2023-01-08       D  South    214     88  Alice  January      Q1
8  2023-01-09       A   East    673     40   John  January      Q1
9  2023-01-10       B   West    927     59   Mary  January      Q1
10 2023-01-11       C  North    969     98    Bob  January      Q1
11 2023-01-12       D  South    816     28  Alice  January      Q1
12 2023-01-13       A   East    568     47   John  January      Q1
13 2023-01-14       B   West    619     32   Mary  January      Q1
14 2023-01-15       C  North    548     98    Bob  January      Q1
15 2023-01-16       D  South    346     93  Alice  January      Q1
16 2023-01-17       A   East    469     72   John  January      Q1
17 2023-01-18       B   West    688     92   Mary  January      Q1
18 2023-01-19       C  North    603     52    Bob  January      Q1
19 2023-01-20       D  South    356     43  Alice  January      Q1

In [66]:
pd.pivot_table(df,values = 'Sales' , index='Region',columns="Product", aggfunc="median")

Product      A      B      C      D
Region
East     568.0    NaN    NaN    NaN
North      NaN    NaN  949.0    NaN
South      NaN    NaN    NaN  346.0
West       NaN  619.0    NaN    NaN

In [67]:
pd.pivot_table(df,values = ['Sales','Units'], index='Region',columns="Product")

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     528.2    NaN    NaN    NaN  59.2   NaN   NaN   NaN
North      NaN    NaN  807.6    NaN   NaN   NaN  66.8   NaN
South      NaN    NaN    NaN  378.0   NaN   NaN   NaN  56.6
West       NaN  612.4    NaN    NaN   NaN  54.0   NaN   NaN

# cross tabs

In [68]:
# it like they use fro counting purpose

In [69]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

# Operations

**DataFrames Basic Operations**

In [70]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [71]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [72]:
df.shape

(20, 8)

In [73]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [74]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [75]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [76]:
df1['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

**DataFrames Applying Functions**

In [77]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [78]:
def square(x):
    return x**2

In [79]:
# df1["B"] = df1["B"].apply(square)

In [80]:
# df1

In [81]:
# df1["D"] = df1["B"].apply(square)
df1["D"] = df1["B"].apply(lambda x : x**2)
df1

   A   B    C     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500

**Real data**

In [82]:
# In new file